                 DCLF       FILE(QTEMP/DSPFDPF)
             DCL        VAR(&VAR1) TYPE(*CHAR) LEN(30)
             DCL        VAR(&FROMMBR) TYPE(*CHAR) LEN(100)
             DCL        VAR(&TOSTMF) TYPE(*CHAR) LEN(100)
DCL &EOF *LGL
   RCVF
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
 DOWHILE COND(*not &EOF)
             CHGVAR     VAR(&FROMMBR) +
                          VALUE('/QSYS.LIB/USER01741.LIB/BACKUPTOPC.F+
                         ILE/' *CAT &MLNAME *TCAT '.MBR')
             CHGVAR     VAR(&TOSTMF) +
                          VALUE('/HOME/user0174/BackupToPc/' *CAT +
                          &MLNAME *TCAT '.' *TCAT &MLSEU)


    /*       SNDUSRMSG  MSGID(CPF9898) MSGF(QCPFMSG) +
                          MSGDTA(&FROMMBR)               */
      /*     SNDUSRMSG  MSGID(CPF9898) MSGF(QCPFMSG) +
                          MSGDTA(&TOSTMF)                     */

             CPYTOSTMF  FROMMBR(&FROMMBR) TOSTMF(&TOSTMF) +
                          STMFOPT(*REPLACE)
RCVF
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
ENDDO






