      *
      * ˆˆWritten by MR on 27-Oct-2020
      *
     h COPYRIGHT('Reymont All rights reserved.')
     h option(*nodebugio:*srcstmt:*nounref) dftactgrp(*no)
      *
     fR473SUM1d CF   E             WORKSTN indds(Dspf) sfile(SFL01:Z1RRN)
     fR473SUM1l IF   E           K DISK    Rename(TCBOPOR:filfmt1)              TCBOPO:TORDNO  jlf
     fR473SUM2l IF   E           K DISK    Rename(TCBOPOR:filfmt2)              TCBOPO:TOONUM  jlf
     fR473SUM3l IF   E           K DISK    Rename(D2DGENDf:filfmt3)             D2DGEND:DERBLF jlf
      * ‚Program status data structure. .
     d PgmDs          SDS                  qualified
     d  PgmName          *proc
      * ‚Screen indicators used. .
     d Dspf            DS                  qualified
     d  Exit                   3      3N
     d  Refresh                5      5N
     d  SflDspCtl             30     30N
     d  SflDsp                31     31N
      *
     d MaxSfl          C                   9999                                 DDS:SFLSIZ
      * ‚ Current serch positions
     d Cur           e ds                  qualified extname(R473SUM1l)
     d   Position1   e                     extfld(TORDNO)
     d   Position2   e                     extfld(TOONUM)
     d   Position3   e                     extfld(DERBLF)
      * ‚ Previous serch positions
     d Prv           e ds                  qualified extname(R473SUM1l)
     d   Position1   e                     extfld(TORDNO)
     d   Position2   e                     extfld(TOONUM)
     d   Position3   e                     extfld(DERBLF)
      *  ‚Empty serch positions
     d Emp           e ds                  qualified extname(R473SUM1l)
     d   Position1   e                     extfld(TORDNO)
     d   Position2   e                     extfld(TOONUM)
     d   Position3   e                     extfld(DERBLF)
      *  ‚Local variables used here. . .
     D SearchField     S              1A
      *  -----------------------------------------------------------
      *  ‚Initialize the progrm variables usd here. .
     c                   callp     Initialize()
      *  -------------- B O D Y ------------------------------------
     c     *loval        setll     filfmt1
     c                   callp     LoadSubfile()
     c                   dow       (1 = 1)
     c                   write     FOOTER
     c                   exfmt     CTL01
     c                   callp     GetScrnFlds()
     c                   if        (Dspf.Exit)
     c                   leave
      *  ‚Refrsh pressed. .
     c                   elseif    (Dspf.Refresh)
     c                   callp     Refresh()
     c                   iter
      *  ‚Search possitions handlie here. .
     c                   elseif    (Z1POSITION>0 or Z2POSITION>0
     c                             or Z3POSITION<>*blanks)
     c                   callp     PositionTo()
     c                   iter
      *
     c                   endif
      *  ‚Option processed here. .
     c                   if        (Dspf.SflDsp)                                if subfile not empty
     c                   callp     ReadSubfile()
     c                   endif
     c                   enddo
      *
     c                   eval      *inlr = *on
      *  S U B   P R O C E D U E R E S --------------------------
     PGetScrnFlds      B
      *  ‚Geting screen fields to local variables. .
     c                   eval      Cur.Position1 = Z1POSITION
     c                   eval      Cur.Position2 = Z2POSITION
     c                   eval      Cur.Position3 = Z3POSITION
     P                 E
      *
     PLoadSubfile      B
      *  ‚Loading subfile with data. .
     c                   eval      Dspf.SflDspCtl = *off
     c                   eval      Dspf.SflDsp = *off
     c                   write     CTL01
     c                   eval      Dspf.SflDspCtl = *on
     c                   eval      Z1OPT = ' '
     c                   for       Z1RRN = 1 to MaxSfl
      *  ‚Populate from file TCBOPOD fields  TORDNO and TOONUM
     c                   if        SearchField = '3'
     c                   read      filfmt3
      *  ‚Ppulate from file TCBOPOD fields  TORDNO and TOONUM
     c                   elseif    SearchField = '2'
     c                   read      filfmt2
     c                   else
     c                   read      filfmt1
     c                   endif
      *
     c                   if        (%eof)
     c                   leave
     c                   endif
      *
     c                   write     SFL01
     c                   endfor
     c                   if        (Z1RRN > 1)
     c                   eval      Dspf.SflDsp = *on
     c                   endif
     P                 E

     PReadSubfile      B
      *  ‚Read subfile changes made. .
     c                   dow       (1 = 1)
     c                   readc     SFL01                                        if opt changed
     c                   if        (%eof)
     c                   leave
     c                   endif
      *  ‚Option handling
     c                   if        Z1OPT = '5'
     c                   exfmt     display
     c                   eval      Dspf.Exit = *off
     c                   eval      Z1OPT = ' '
     c                   endif
      *
     c                   eval      Z1OPT = ' '
     c                   update    SFL01
     c                   enddo
     P                 E
     PInitialize       B
      *  ‚Inetilizing program variables. . .
     c                   eval      Z1SCREEN = %trimr(PgmDs.PgmName) + '-1'
     c                   eval      Z1DATE = %date()
     c                   eval      SearchField = '1'
      *  ‚Seting Emply positon data structure. . .
     c                   eval      Emp.Position1 = *zeros
     c                   eval      Emp.Position2 = *zeros
     c                   eval      Emp.Position3 = *blanks
      *  ‚Now emply other 2 positon data structure Cur and Prv. . .
     c                   eval      Cur = Emp
     c                   eval      Prv = Emp
     P                 E
      *
     PRefresh          B
      *  ‚Refresh the screen by pressing F5. .
     c                   eval      Z1POSITION = 0
     c                   eval      Z2POSITION = 0
     c                   eval      Cur = Emp
     c                   eval      Prv = Emp
     c                   eval      SearchField = '1'
     c     *loval        setll     filfmt1
     c                   callp     LoadSubfile()
     P                 E
      *
     PPositionTo       B
      *  ‚Position the record pointer according to the serch field. .
     c                   if        (Cur.Position1 <> Prv.Position1)
     c                   eval      SearchField = '1'
     c                   eval      Prv.Position1= Cur.Position1
     c                   eval      Z2POSITION   = 0
     c                   eval      Prv.Position2 = 0
     c                   eval      Z3POSITION   = *blanks
     c                   eval      Prv.Position3 = *blanks
     c     Z1POSITION    setll     filfmt1
     c                   callp     LoadSubfile()
     c                   elseif    (Cur.Position2 <> Prv.Position2)
     c                   eval      SearchField = '2'
     c                   eval      Prv.Position2= Cur.Position2
     c                   eval      Z1POSITION   = 0
     c                   eval      Prv.Position1 = 0
     c                   eval      Z3POSITION   = *blanks
     c                   eval      Prv.Position3 = *blanks
     c     Z2POSITION    setll     filfmt2
     c                   callp     LoadSubfile()
     c                   elseif    (Cur.Position3 <> Prv.Position3)
     c                   eval      SearchField = '3'
     c                   eval      Prv.Position3= Cur.Position3
     c                   eval      Z1POSITION   = 0
     c                   eval      Prv.Position1 = 0
     c                   eval      Z2POSITION   = 0
     c                   eval      Prv.Position2 = 0
     c     Z3POSITION    setll     filfmt3
     c                   callp     LoadSubfile()
     c                   endif
     P                 E
