/*ˆ**************************************************************************/
/*ˆClear file and add records                                               */
/*ˆ**************************************************************************/
/*                                                                          */
     PGM
     DCL        VAR(&FILE ) TYPE(*CHAR) LEN(10) VALUE('R473SUM2P ')
             DCL        VAR(&MSGDTA    ) TYPE(*CHAR) LEN(100)
             DCL        VAR(&S) TYPE(*CHAR) LEN(200)

/*‚Clear file                                                                */
             CLRPFM     FILE(&FILE)
/*‚Set nalues to variable and run sql staement                               */
             CHGVAR     VAR(&S) VALUE('6000029, 64, 0')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('6000030, 65, 0')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('6000031, 66, 0')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('6000032, 67, 0')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('6000033, 68, 0')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('6000033, 68, 0')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('6000034, 69, 0')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('6000035, 70, 0')
             CALLSUBR   SUBR(runsqllin)
/*‚Exit msg */
             CHGVAR     VAR(&MSGDTA) VALUE('File' *BCAT &FILE *BCAT +
                          'Populated succesfuly')
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSGDTA) +
                          MSGTYPE(*COMP)
/*‚S U B   R O U T E N E S  */
             SUBR       SUBR(runsqllin)
             RUNSQL SQL('INSERT INTO ' !! &FILE !<' VALUES(' !! &s !< ')') COMMIT(*NONE)
             ENDSUBR
/*‚End of program */
                   ENDPGM
