/*ˆ**************************************************************************/
/*ˆClear file and add records                                               */
/*ˆ**************************************************************************/
/*                                                                          */
     PGM
     DCL        VAR(&FILE ) TYPE(*CHAR) LEN(10) VALUE('R473SUM1P ')
             DCL        VAR(&MSGDTA    ) TYPE(*CHAR) LEN(100)
             DCL        VAR(&S) TYPE(*CHAR) LEN(200)

/*‚Clear file                                                                */
             CLRPFM     FILE(&FILE)
/*‚Set values to variable and run sql staement                               */
             CHGVAR     VAR(&S) VALUE('66, 596')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('67, 617')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('68, 618')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('69, 619')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('70, 620')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('71, 621')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('72, 622')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('73, 623')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('74, 624')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('75, 625')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('76, 626')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('77, 654')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('78, 731')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('64, 589')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('65, 595')
             CALLSUBR   SUBR(runsqllin)
             CHGVAR     VAR(&S) VALUE('66, 596')
             CALLSUBR   SUBR(runsqllin)
/*‚Exit msg */
             CHGVAR     VAR(&MSGDTA) VALUE('File' *BCAT &FILE *BCAT +
                          'Populated succesfuly')
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSGDTA) +
                          MSGTYPE(*COMP)
/*‚S U B   R O U T E N E S  */
             SUBR       SUBR(runsqllin)
             RUNSQL SQL('INSERT INTO ' !! &FILE !<' VALUES(' !! &s !< ')') COMMIT(*NONE)
             ENDSUBR
/*‚End of program */
                   ENDPGM
