/*                                                                   */
/* Read outfile and create souce member lit                          */
             DCLF       FILE(QAUOOPT   )
/*           DCL        VAR(&VAR1) TYPE(*CHAR) LEN(30)               */
/*           DCL        VAR(&FROMMBR) TYPE(*CHAR) LEN(100)           */
/*           DCL        VAR(&TOSTMF) TYPE(*CHAR) LEN(100)            */
/*           DCL        VAR(&TEXT) TYPE(*CHAR) LEN(250)              */
/*           DCL        VAR(&CURusr) TYPE(*CHAR) LEN(10)             */
/*           DCL        VAR(&SRCDATA1) TYPE(*CHAR) LEN(100)          */
             DCL        VAR(&SRCDATA ) TYPE(*CHAR) LEN(100)
             DCL        VAR(&EOF) TYPE(*LGL)
             DCL        VAR(&CURLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&msg   ) TYPE(*CHAR) LEN(100)
             RTVDTAARA  DTAARA(QTEMP/glCURLIB *ALL) RTNVAR(&CURLIB)
/*           RTVDTAARA  DTAARA(QTEMP/glSRCFIL *ALL) RTNVAR(&SRCFIL)  */
             CHGVAR     VAR(&SRCFIL  ) VALUE('BACKUPTOPc')
             CLRPFM     FILE(&CURLIB/&SRCFIL) MBR(QAUOOPT)
   /*        OVRDBF     FILE(QADSPFFD ) TOFILE(QTEMP/DSPFDPF) +
                        SECURE(*YES) +
                          OVRSCOPE(*JOB) SHARE(*YES)              */
   RCVF
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
 DOWHILE COND(*not &EOF)
             CHGVAR     VAR(&SRCDATA) VALUE(&OPTION *CAT ' ' *CAT +
                          &COMMAND)
             EDTSRC     SRCFILE(QAUOOPT/&CURLIB/&SRCFIL) +
                          SRCDATA(&SRCDATA) CRTFILE(*NO) CRTMEMBER(*NO)
RCVF
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
ENDDO
             EDTSRC     SRCFILE(QAUOOPT/&CURLIB/&SRCFIL) SRCDATA('   +
                          ') ACTION(*END) CRTFILE(*NO) CRTMEMBER(*NO)

             CHGVAR     VAR(&MSG) VALUE('All records of the file +
                          QAUOOPT copyed to Source member. .')

             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSG) +
                          MSGTYPE(*COMP)
