/* Run follwing sql outfile in qtemp to get mbrlst                 */
/* SELECT * FROM USER01741/BackupToPc mbrlst                       */
             DCLF       FILE(BACKUPTOPc) /* Run sql to crate MBRLST +
                          in QTEMP */
             DCL        VAR(&VAR1) TYPE(*CHAR) LEN(30)
             DCL        VAR(&TEXT) TYPE(*CHAR) LEN(50)
             DCL        VAR(&CURusr) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCDATA) TYPE(*CHAR) LEN(100)
             DCL        VAR(&SRCDATA1) TYPE(*CHAR) LEN(100)
             DCL        VAR(&EOF) TYPE(*LGL)
             DCL        VAR(&CURLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(100)
             DCL        VAR(&MLNAME) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MLSEU2) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MLMTXT) TYPE(*CHAR) LEN(100)
             RTVDTAARA  DTAARA(QTEMP/GLCURLIB *ALL) RTNVAR(&CURLIB)
             RTVDTAARA  DTAARA(QTEMP/GLSRCFIL *ALL) RTNVAR(&SRCFIL)
             CHGVAR     VAR(&CURUSR) VALUE(%SST(&CURLIB 1 8))
             OVRDBF     FILE(BackupToPc) TOFILE(&CURLIB/BACKUPTOPC) +
                          MBR(MBRLST) SECURE(*YES) +
                          OVRSCOPE(*JOB) SHARE(*YES)
   RCVF
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
 DOWHILE COND(*not &EOF)
             CHGVAR     VAR(&MLNAME) VALUE(%SST(&SRCDTA 1 10))
             CHGVAR     VAR(&MLSEU2) VALUE(%SST(&SRCDTA 12 10))
             CHGVAR     VAR(&MLMTXT) VALUE(%SST(&SRCDTA 23 78))
             CHGVAR     VAR(&TEXT) VALUE(&MLMTXT)
             CHGVAR     VAR(&SRCDATA) VALUE(&MLNAME *CAT ' ' *CAT +
                          &MLSEU2 *CAT ' ' *CAT &MLMTXT)
             CHGPFM     FILE(&CURLIB/&SRCFIL) MBR(&MLNAME) +
                          SRCTYPE(&MLSEU2) TEXT(&MLMTXT)
             MONMSG     MSGID(CPF3275)  /* Mbr not fond */
             MONMSG     MSGID(CPF3288)  /* Mbr not changed */
RCVF
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
ENDDO
 OUT:
/*           DLTOVR     FILE(BackupToP0) LVL(*JOB)               */
             CHGVAR     VAR(&MSG) VALUE('All members of the source +
                          pf' *BCAT &SRCFIL *TCAT ' atribuets +
                          changed from MBRLST.TXT')

             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSG) +
                          MSGTYPE(*COMP)
