/* Convert print to physical file                                    */
/******************************************************************************/
/* PROGRAM NAME . . . . . . . . . . . . . . :   cvtprtpf                      */
/* AUTHOR . . . . . . . . . . . . . . . . . :   RAYMOND G. JOHNSON            */
/* DATE CREATED . . . . . . . . . . . . . . :   02/16/2007                    */
/*                                                                            */
/* PROGRAM INFORMATION:  Convert print to physical file.                      */
/*                                                                            */
/*                                                                            */
/******************************************************************************/
/* CHANGE LOG:                                                                */
/******************************************************************************/
/* DATE         INITIALS   CHANGE DESCRIPTION                                 */
/******************************************************************************/
/* XX/XX/200X   XXX                                                           */
/*                                                                            */
/*                                                                            */
/******************************************************************************/
PGM          PARM(&CMD &PRTF &QF &MEMBER)

             DCL        VAR(&MSGDTA)  TYPE(*CHAR) LEN(80)
             DCL        VAR(&MSGID)   TYPE(*CHAR) LEN(7)
             DCL        VAR(&CPYR)    TYPE(*CHAR) LEN(30) +
                          VALUE('ISOLUTIONS CONSULTING, INC.')

             DCL        VAR(&XXXXXXX) TYPE(*CHAR) LEN(10)
             DCL        VAR(&YYYYYYY) TYPE(*CHAR) LEN(20)

             DCL        VAR(&CMD)     TYPE(*CHAR) LEN(3000)
             DCL        VAR(&FILE)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&MBR)     TYPE(*CHAR) LEN(10)
             DCL        VAR(&MBROPT)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&MEMBER)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&PRTF)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&QF)      TYPE(*CHAR) LEN(20)
/******************************************************************************/
/*           GLOBAL MONITOR MESSAGE - STANDARD ERROR EXIT                     */
/******************************************************************************/

             MONMSG     MSGID(CPF0000 MCH0000) EXEC(GOTO CMDLBL(ERROR))

/******************************************************************************/
/*           START OF PROGRAM.                                                */
/******************************************************************************/

            CHGVAR     VAR(&FILE)     VALUE(%SST(&QF 1 10))
            CHGVAR     VAR(&LIB)      VALUE(%SST(&QF 11 10))
            CHGVAR     VAR(&MBR)      VALUE(%SST(&MEMBER 3 10))
            CHGVAR     VAR(&MBROPT)   VALUE(%SST(&MEMBER 13 8))

            CHKOBJ     OBJ(&LIB/&FILE) OBJTYPE(*FILE)

            MONMSG     MSGID(CPF9898) EXEC(DO)
               SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) +
                         MSGDTA('LIBRARY' *BCAT 'not found') +
                         MSGTYPE(*ESCAPE)
               RETURN
            ENDDO

            MONMSG     MSGID(CPF9801) EXEC(DO)
              CRTPF      FILE(&LIB/&FILE) RCDLEN(512)
            ENDDO

            CHKOBJ     OBJ(&LIB/&FILE) OBJTYPE(*FILE) MBR(&MBR)
            MONMSG     MSGID(CPF9815) EXEC(DO)
              ADDPFM     FILE(&LIB/&FILE) MBR(&MBR)
            ENDDO
            OVRPRTF    FILE(&PRTF) HOLD(*YES)

             CALL       PGM(QCMDEXC) PARM(&CMD 3000)

             MONMSG     MSGID(CPF0000) EXEC(DO)
               SNDPGMMSG  MSG(&CMD *BCAT 'failed')
               RETURN
             ENDDO

             CPYSPLF    FILE(&PRTF) TOFILE(&LIB/&FILE) JOB(*) +
                          SPLNBR(*LAST)

             DLTSPLF    FILE(&PRTF) JOB(*) SPLNBR(*LAST) +
                          SELECT(*CURRENT)

             DLTOVR     FILE(&PRTF)
  RETURN:     RETURN
 /******************************************************************************/
 /*           END OF PROGRAM / ERROR EXIT                                      */
 /******************************************************************************/

  ERROR:      RCVMSG     MSGTYPE(*EXCP)  MSGDTA(&MSGDTA) +
                           MSGID(&MSGID)
              MONMSG     MSGID(CPF0000)
              SNDPGMMSG  MSGID(&MSGID) MSGF(QCPFMSG) MSGDTA(&MSGDTA) +
                           MSGTYPE(*ESCAPE)
              MONMSG     MSGID(CPF0000)
  END:        ENDPGM
