/*                                                                     */
             PGM        PARM(&MNUPARM)
             DCLF       FILE(BACKUPTOPC) /* we need only the +
                          structure */
             DCL        VAR(&VAR1) TYPE(*CHAR) LEN(30)
/*           DCL        VAR(&TEXT) TYPE(*CHAR) LEN(50)                 */
             DCL        VAR(&CURusr) TYPE(*CHAR) LEN(10)
/*           DCL        VAR(&SRCDATA) TYPE(*CHAR) LEN(100)             */
/*           DCL        VAR(&SRCDATA1) TYPE(*CHAR) LEN(100)            */
             DCL        VAR(&EOF) TYPE(*LGL)
             DCL        VAR(&CURLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(100)
/*           DCL        VAR(&MLNAME) TYPE(*CHAR) LEN(10)               */
/*           DCL        VAR(&MLSEU2) TYPE(*CHAR) LEN(10)               */
/*           DCL        VAR(&MLMTXT) TYPE(*CHAR) LEN(100)              */
             DCL        VAR(&MNUPARM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MNUMSGF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MNUDSPF) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MNUMSGFMBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SEQ    ) TYPE(*CHAR) LEN( 4)
             DCL        VAR(&CMD    ) TYPE(*CHAR) LEN(95)
             DCL        VAR(&MSGID  ) TYPE(*CHAR) LEN( 7)
             RTVDTAARA  DTAARA(QTEMP/GLCURLIB *ALL) RTNVAR(&CURLIB)
             RTVDTAARA  DTAARA(QTEMP/GLSRCFIL *ALL) RTNVAR(&SRCFIL)
             CHGVAR     VAR(&CURUSR) VALUE(%SST(&CURLIB 1 8))
             CHGVAR     VAR(&MNUDSPF) VALUE(&MNUPARM)
             CHGVAR     VAR(&MNUMSGF) VALUE(&MNUPARM)
             CHGVAR     VAR(&MNUMSGFMBR) VALUE(&MNUPARM *TCAT 'QQ')
             OVRDBF     FILE(&SRCFIL) TOFILE(&CURLIB/&SRCFIL) +
                          MBR(&MNUMSGFMBR) SECURE(*YES) +
                          OVRSCOPE(*JOB) SHARE(*YES)
             DLTMSGF    MSGF(QTEMP/&MNUMSGF)
             MONMSG     MSGID(CPF2112 CPF2105)
             CRTMSGF QTEMP/&MNUMSGF

   RCVF
   RCVF     /* Ignore 1st record */
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
 DOWHILE COND(*not &EOF)
             CHGVAR     VAR(&SEQ) VALUE(%SST(&SRCDTA 1 4))
             CHGVAR     VAR(&CMD) VALUE(%SST(&SRCDTA 6 94))
             CHGVAR     VAR(&MSGID) VALUE('USR' *CAT &SEQ)
   /*        SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&SEQ +
                          *CAT &CMD) MSGTYPE(*ESCAPE)                 */
             ADDMSGD    MSGID(&MSGID) MSGF(QTEMP/&MNUPARM) MSG(&CMD)
             MONMSG     MSGID(CPF3275)  /* Mbr not fond */
             MONMSG     MSGID(CPF3288)  /* Mbr not changed */
RCVF
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&EOF) +
                          VALUE(*NOT &EOF))
ENDDO
 OUT:
             DLTOVR     FILE(&SRCFIL) LVL(*JOB)
             CRTDSPF    FILE(QTEMP/&MNUMSGF) +
                          SRCFILE(&CURLIB/&SRCFIL)
             CRTMNU     MENU(QTEMP/MNUMAIN) TYPE(*DSPF) +
                          DSPF(QTEMP/*MENU) MSGF(QTEMP/*MENU)
             CHGVAR     VAR(&MSG) VALUE('Menus created in library +
                          QTEP successfully. . .')

             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSG) +
                          MSGTYPE(*COMP)
