/*                                                        */
/* Copy pf to src filee member pdm user options           */
             DCL        VAR(&CURLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&msg   ) TYPE(*CHAR) LEN(100)
             RTVDTAARA  DTAARA(QTEMP/glCURLIB *ALL) RTNVAR(&CURLIB)
/*           RTVDTAARA  DTAARA(QTEMP/glSRCFIL *ALL) RTNVAR(&SRCFIL)  */
             CHGVAR     VAR(&SRCFIL  ) VALUE('BACKUPTOPc')
 /*            CLRPFM     FILE(&CURLIB/&SRCFIL) MBR(QAUOOPT) */
             CPYF       FROMFILE(&CURLIB/QAUOOPT) +
                          TOFILE(&CURLIB/&SRCFIL) +
                          FROMMBR(*FIRST) TOMBR(QAUOOPT) +
                          MBROPT(*REPLACE) CRTFILE(*NO) FMTOPT(*CVTSRC)
             CHGVAR     VAR(&MSG) VALUE('Copy pf to source file +
                          member compleated. .')
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSG) +
                          MSGTYPE(*COMP)

